In [13]:
import pandas as pd
import numpy as np

In [14]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [15]:
# df_temp = pd.DataFrame()

In [16]:
df_temp = df.copy()

1. Some values in the the FlightNumber column are missing. These numbers are
    meant to increase by 10 with each row so 10055 and 10075 need to be put in
    place. Fill in these missing numbers and make the column an integer column
    (instead of a float column).

In [39]:
val = []
for num in range(100045,100095,10):
    val.append(num)
    
df_temp['FlightNumber'] = val

In [41]:
df_temp['FlightNumber'] = df_temp['FlightNumber'].astype(int)

In [42]:
df_temp

,Airline,FlightNumber,RecentDelays,From,To,delay_1,delay_2,delay_3
0,KLM(!),100045,"[23, 47]",London,Paris,23.0,47.0,NaN
1,<Air France> (12),100055,[],Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),100065,"[24, 43, 87]",London,Stockholm,24.0,43.0,87.0
3,12. Air France,100075,[13],Budapest,Paris,13.0,NaN,NaN
4,"""Swiss Air""",100085,"[67, 32]",Brussels,London,67.0,32.0,NaN

In [ ]:
2. The From_To column would be better as two separate columns! Split each
    string on the underscore delimiter _ to give a new temporary DataFrame with
    the correct values. Assign the correct column names to this temporary
    DataFrame.

In [17]:
df_temp[['From','To']] = df.From_To.str.split("_",expand=True)

In [18]:
df_temp

,Airline,FlightNumber,From_To,RecentDelays,From,To
0,KLM(!),10045.0,LoNDon_paris,"[23, 47]",LoNDon,paris
1,<Air France> (12),NaN,MAdrid_miLAN,[],MAdrid,miLAN
2,(British Airways. ),10065.0,londON_StockhOlm,"[24, 43, 87]",londON,StockhOlm
3,12. Air France,NaN,Budapest_PaRis,[13],Budapest,PaRis
4,"""Swiss Air""",10085.0,Brussels_londOn,"[67, 32]",Brussels,londOn

3. Notice how the capitalisation of the city names is all mixed up in this
    temporary DataFrame. Standardise the strings so that only the first letter is
    uppercase (e.g. "londON" should become "London".)

In [19]:
df_temp['From'] = df_temp['From'].str.lower()
df_temp['From'] = df_temp['From'].str.capitalize()
df_temp['To'] = df_temp['To'].str.lower()
df_temp['To'] = df_temp['To'].str.capitalize()

In [20]:
df_temp

,Airline,FlightNumber,From_To,RecentDelays,From,To
0,KLM(!),10045.0,LoNDon_paris,"[23, 47]",London,Paris
1,<Air France> (12),NaN,MAdrid_miLAN,[],Madrid,Milan
2,(British Airways. ),10065.0,londON_StockhOlm,"[24, 43, 87]",London,Stockholm
3,12. Air France,NaN,Budapest_PaRis,[13],Budapest,Paris
4,"""Swiss Air""",10085.0,Brussels_londOn,"[67, 32]",Brussels,London

4. Delete the From_To column from df and attach the temporary DataFrame
    from the previous questions.

In [21]:
df_temp = df_temp.drop(columns=['From_To'])

In [22]:
df_temp

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)       10045.0      [23, 47]    London      Paris
1    <Air France> (12)           NaN            []    Madrid      Milan
2  (British Airways. )       10065.0  [24, 43, 87]    London  Stockholm
3       12. Air France           NaN          [13]  Budapest      Paris
4          "Swiss Air"       10085.0      [67, 32]  Brussels     London

5. In the RecentDelays column, the values have been entered into the
    DataFrame as a list. We would like each first value in its own column, each
    second value in its own column, and so on. If there isn't an Nth value, the value
    should be NaN.

In [23]:
df_temp[['delay_1','delay_2','delay_3']] = pd.DataFrame(df_temp.RecentDelays.values.tolist(), index= df.index)

In [43]:
df_temp = df_temp.drop(columns=['RecentDelays'])

In [44]:
df_temp

,Airline,FlightNumber,From,To,delay_1,delay_2,delay_3
0,KLM(!),100045,London,Paris,23.0,47.0,NaN
1,<Air France> (12),100055,Madrid,Milan,NaN,NaN,NaN
2,(British Airways. ),100065,London,Stockholm,24.0,43.0,87.0
3,12. Air France,100075,Budapest,Paris,13.0,NaN,NaN
4,"""Swiss Air""",100085,Brussels,London,67.0,32.0,NaN